QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/source/platform/hal/nxp/mcu/LPC18xx/vendor/lpc18xx_clkpwr.c
/***********************************************************************//**
 * @file                lpc18xx_clkpwr.c
 * @brief               Contains all functions support for Clock and Power Control
 *                              firmware library on LPC18xx
 * @version             1.0
 * @date                14. Dec. 2010
 * @author              NXP MCU SW Application Team
 **************************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 **********************************************************************/

/* Peripheral group ----------------------------------------------------------- */
/** @addtogroup CLKPWR
 * @{
 */

/* Includes ------------------------------------------------------------------- */

#include "lpc_types.h"
#include "lpc18xx_scu.h"
#include "lpc18xx_clkpwr.h"

/*TODO List:
 * SET PLL0
 * UPDATE Clock from PLL0
 * SetDIV uncheck value
 * GetBaseStatus BASE_SAFE
 * */

/* Local definition */
#define CLKPWR_ADDRESS32(x,y) (*(uint32_t*)((uint32_t)x+y))

/* Local Variable */
const int16_t CLKPWR_Entity_ControlReg_Offset[CLKPWR_ENTITY_NUM] = {
                -1,             //CLKPWR_CLKSRC_32KHZ_OSC,
                -1,             //CLKPWR_CLKSRC_IRC,
                -1,             //CLKPWR_CLKSRC_ENET_RX_CLK,
                -1,             //CLKPWR_CLKSRC_ENET_TX_CLK,
                -1,             //CLKPWR_CLKSRC_GP_CLKIN,
                -1,             //CLKPWR_CLKSRC_TCK,
                0x18,   //CLKPWR_CLKSRC_XTAL_OSC,
                0x20,   //CLKPWR_CLKSRC_PLL0,
                0x30,   //CLKPWR_CLKSRC_PLL1,
                -1,             //CLKPWR_CLKSRC_RESERVE,
                -1,             //CLKPWR_CLKSRC_RESERVE,
                0x34,   //CLKPWR_CLKSRC_IDIVA,,
                0x38,   //CLKPWR_CLKSRC_IDIVB,
                0x3C,   //CLKPWR_CLKSRC_IDIVC,
                0x40,   //CLKPWR_CLKSRC_IDIVD,
                0x44,   //CLKPWR_CLKSRC_IDIVE,

                0x48,   //CLKPWR_BASE_SAFE,
                0x4C,   //CLKPWR_BASE_USB0,
                -1,             //CLKPWR_BASE_RESERVE,
                0x54,   //CLKPWR_BASE_USB1,
                0x58,   //CLKPWR_BASE_M3,
                0x5C,   //CLKPWR_BASE_SPIFI,
                -1,             //CLKPWR_BASE_RESERVE,
                0x64,   //CLKPWR_BASE_PHY_RX,
                0x68,   //CLKPWR_BASE_PHY_TX,
                0x6C,   //CLKPWR_BASE_APB1,
                0x70,   //CLKPWR_BASE_APB3,
                0x74,   //CLKPWR_BASE_LCD,
                -1,             //CLKPWR_BASE_RESERVE
                0x7C,   //CLKPWR_BASE_SDIO,
                0x80,   //CLKPWR_BASE_SSP0,
                0x84,   //CLKPWR_BASE_SSP1,
                0x88,   //CLKPWR_BASE_UART0,
                0x8C,   //CLKPWR_BASE_UART1,
                0x90,   //CLKPWR_BASE_UART2,
                0x94,   //CLKPWR_BASE_UART3,
                0x98    //CLKPWR_BASE_CLKOUT
};

const uint8_t CLKPWR_ConnectAlloc_Tbl[CLKPWR_CLKSRC_NUM][CLKPWR_ENTITY_NUM] = {
//       3 I E E G T X P P x x D D D D D S U x U M S x P P A A L x S S S U U U U C
//       2 R R T P C T L L     I I I I I A S   S 3 P   H H P P C   D S S R R R R O
//         C X X I K A 0 1     A B C D E F B   B   F   RxTx1 3 D   I 0 1 0 1 2 3
                {0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_32KHZ_OSC = 0,*/
                {0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,1,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_IRC,*/
                {0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_ENET_RX_CLK,*/
                {0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_ENET_TX_CLK,*/
                {0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_GP_CLKIN,*/
                {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},/*CLKPWR_CLKSRC_TCK,*/
                {0,0,0,0,0,0,0,1,1,0,0,1,1,1,1,1,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_XTAL_OSC,*/
                {0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},/*CLKPWR_CLKSRC_PLL0,*/
                {0,0,0,0,0,0,0,1,0,0,0,1,1,1,1,1,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_PLL1,*/
                {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
                {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
                {0,0,0,0,0,0,0,1,1,0,0,0,1,1,1,1,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_IDIVA = CLKPWR_CLKSRC_PLL1 + 3,*/
                {0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_IDIVB,*/
                {0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_IDIVC,*/
                {0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1},/*CLKPWR_CLKSRC_IDIVD,*/
                {0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1}/*CLKPWR_CLKSRC_IDIVE,*/
};

const CLKPWR_PERIPHERAL_S CLKPWR_PERIPHERAL_Info[CLKPWR_PERIPHERAL_NUM] = {
        /*      Register Clock                  |       Peripheral Clock
                 |      BASE    |               BRANCH  |       BASE            |       BRANCH          */
                {CLKPWR_BASE_APB3,      0x1118, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_ADC0,
                {CLKPWR_BASE_APB3,      0x1120, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_ADC1,
                {CLKPWR_BASE_M3,        0x1460, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_AES,
                ////    CLKPWR_PERIPHERAL_ALARMTIMER_CGU_RGU_RTC_WIC,
                {CLKPWR_BASE_APB1,      0x1200, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_APB1_BUS,
                {CLKPWR_BASE_APB3,      0x1100, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_APB3_BUS,
                {CLKPWR_BASE_APB3,      0x1128, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_CAN,
                {CLKPWR_BASE_M3,        0x1538, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_CREG,
                {CLKPWR_BASE_APB3,      0x1110, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_DAC,
                {CLKPWR_BASE_M3,        0x1440, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_DMA,
                {CLKPWR_BASE_M3,        0x1430, CLKPWR_BASE_M3,         0x1478, 0},//CLKPWR_PERIPHERAL_EMC,
                {CLKPWR_BASE_M3,        0x1420, CLKPWR_BASE_PHY_RX,     0x0000, CLKPWR_PERIPHERAL_ETHERNET_TX},//CLKPWR_PERIPHERAL_ETHERNET,
                {CLKPWR_ENTITY_NONE,0x0000, CLKPWR_BASE_PHY_TX, 0x0000, 0},//CLKPWR_PERIPHERAL_ETHERNET_TX
                {CLKPWR_BASE_M3,        0x1410, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_GPIO,
                {CLKPWR_BASE_APB1,      0x1210, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_I2C0,
                {CLKPWR_BASE_APB3,      0x1108, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_I2C1,
                {CLKPWR_BASE_APB1,      0x1218, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_I2S,
                {CLKPWR_BASE_M3,        0x1418, CLKPWR_BASE_LCD,        0x0000, 0},//CLKPWR_PERIPHERAL_LCD,
                {CLKPWR_BASE_M3,        0x1448, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_M3CORE,
                {CLKPWR_BASE_M3,        0x1400, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_M3_BUS,
                {CLKPWR_BASE_APB1,      0x1208, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_MOTOCON,
                {CLKPWR_BASE_M3,        0x1630, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_QEI,
                {CLKPWR_BASE_M3,        0x1600, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_RITIMER,
                {CLKPWR_BASE_M3,        0x1468, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_SCT,
                {CLKPWR_BASE_M3,        0x1530, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_SCU,
                {CLKPWR_BASE_M3,        0x1438, CLKPWR_BASE_SDIO,       0x2800, 0},//CLKPWR_PERIPHERAL_SDIO,
                {CLKPWR_BASE_M3,        0x1408, CLKPWR_BASE_SPIFI,      0x1300, 0},//CLKPWR_PERIPHERAL_SPIFI,
                {CLKPWR_BASE_M3,        0x1518, CLKPWR_BASE_SSP0,       0x2700, 0},//CLKPWR_PERIPHERAL_SSP0,
                {CLKPWR_BASE_M3,        0x1628, CLKPWR_BASE_SSP1,       0x2600, 0},//CLKPWR_PERIPHERAL_SSP1,
                {CLKPWR_BASE_M3,        0x1520, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_TIMER0,
                {CLKPWR_BASE_M3,        0x1528, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_TIMER1,
                {CLKPWR_BASE_M3,        0x1618, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_TIMER2,
                {CLKPWR_BASE_M3,        0x1620, CLKPWR_ENTITY_NONE,     0x0000, 0},//CLKPWR_PERIPHERAL_TIMER3,
                {CLKPWR_BASE_M3,        0x1508, CLKPWR_BASE_UART0,      0x2500, 0},//CLKPWR_PERIPHERAL_UART0,
                {CLKPWR_BASE_M3,        0x1510, CLKPWR_BASE_UART1,      0x2400, 0},//CLKPWR_PERIPHERAL_UART1,
                {CLKPWR_BASE_M3,        0x1608, CLKPWR_BASE_UART2,      0x2300, 0},//CLKPWR_PERIPHERAL_UART2,
                {CLKPWR_BASE_M3,        0x1610, CLKPWR_BASE_UART3,      0x2200, 0},//CLKPWR_PERIPHERAL_UART3,
                {CLKPWR_BASE_M3,        0x1428, CLKPWR_BASE_USB0,       0x1800, 0},//CLKPWR_PERIPHERAL_USB0,
                {CLKPWR_BASE_M3,        0x1470, CLKPWR_BASE_USB1,       0x1900, 0},//CLKPWR_PERIPHERAL_USB1,
                {CLKPWR_BASE_M3,        0x1500, CLKPWR_BASE_SAFE,       0x0000, 0},//CLKPWR_PERIPHERAL_WWDT,
};

uint32_t CLKPWR_ClockSourceFrequency[CLKPWR_CLKSRC_NUM] = {0,12000000,0,0,0,0, 0, 480000000,0,0,0,0,0,0,0,0};

#define CLKPWR_CGU_ADDR ((uint32_t)LPC_CGU)
#define CLKPWR_REG_BASE_CTRL(x) (*(uint32_t*)(CLKPWR_CGU_ADDR+CLKPWR_Entity_ControlReg_Offset[CLKPWR_PERIPHERAL_Info[x].RegBaseEntity]))
#define CLKPWR_REG_BRANCH_CTRL(x) (*(uint32_t*)(CLKPWR_CGU_ADDR+CLKPWR_PERIPHERAL_Info[x].RegBranchOffset))
#define CLKPWR_REG_BRANCH_STATUS(x) (*(uint32_t*)(CLKPWR_CGU_ADDR+CLKPWR_PERIPHERAL_Info[x].RegBranchOffset+4))

#define CLKPWR_PER_BASE_CTRL(x) (*(uint32_t*)(CLKPWR_CGU_ADDR+CLKPWR_Entity_ControlReg_Offset[CLKPWR_PERIPHERAL_Info[x].PerBaseEntity]))
#define CLKPWR_PER_BRANCH_CTRL(x) (*(uint32_t*)(CLKPWR_CGU_ADDR+CLKPWR_PERIPHERAL_Info[x].PerBranchOffset))
#define CLKPWR_PER_BRANCH_STATUS(x) (*(uint32_t*)(CLKPWR_CGU_ADDR+CLKPWR_PERIPHERAL_Info[x].PerBranchOffset+4))

/**
 * Init Default Clock for LPC1800 Eval Board
 */
uint32_t        CLKPWR_Init(void){
        CLKPWR_SetXTALOSC(12000000);
        CLKPWR_EnableEntity(CLKPWR_CLKSRC_XTAL_OSC, ENABLE);
        CLKPWR_EntityConnect(CLKPWR_CLKSRC_XTAL_OSC, CLKPWR_CLKSRC_PLL1);
        // Disable PLL1 CPU hang???
        //CLKPWR_EnableEntity(CLKPWR_CLKSRC_PLL1, DISABLE);
        CLKPWR_SetPLL1(6);
        CLKPWR_EnableEntity(CLKPWR_CLKSRC_PLL1, ENABLE);
        CLKPWR_EntityConnect(CLKPWR_CLKSRC_PLL1, CLKPWR_BASE_M3);
        CLKPWR_UpdateClock();
        return 0;
}

uint32_t CLKPWR_ConfigPWR (CLKPWR_PERIPHERAL_T PPType,  FunctionalState en){
        if(PPType >= CLKPWR_PERIPHERAL_WWDT && PPType <= CLKPWR_PERIPHERAL_ADC0)
                return CLKPWR_ERROR_INVALID_PARAM;
        if(en == DISABLE){/* Going to disable clock */
                /*Get Reg branch status */
                if(CLKPWR_PERIPHERAL_Info[PPType].RegBranchOffset!= 0 &&
                                CLKPWR_REG_BRANCH_STATUS(PPType) & 1){
                        CLKPWR_REG_BRANCH_CTRL(PPType) &= ~1; /* Disable branch clock */
                        while(CLKPWR_REG_BRANCH_STATUS(PPType) & 1);
                }
                /* GetBase Status*/
                if((CLKPWR_PERIPHERAL_Info[PPType].RegBaseEntity!=CLKPWR_ENTITY_NONE) &&
                        CLKPWR_GetBaseStatus((CLKPWR_ENTITY_T)CLKPWR_PERIPHERAL_Info[PPType].RegBaseEntity) == 0){
                        /* Disable Base */
                        CLKPWR_EnableEntity((CLKPWR_ENTITY_T)CLKPWR_PERIPHERAL_Info[PPType].RegBaseEntity,0);
                }

                /* Same for Peripheral */
                if((CLKPWR_PERIPHERAL_Info[PPType].PerBranchOffset!= 0) && (CLKPWR_PER_BRANCH_STATUS(PPType) & 1)){
                        CLKPWR_PER_BRANCH_CTRL(PPType) &= ~1; /* Disable branch clock */
                        while(CLKPWR_PER_BRANCH_STATUS(PPType) & 1);
                }
                /* GetBase Status*/
                if((CLKPWR_PERIPHERAL_Info[PPType].PerBaseEntity!=CLKPWR_ENTITY_NONE) &&
                        CLKPWR_GetBaseStatus((CLKPWR_ENTITY_T)CLKPWR_PERIPHERAL_Info[PPType].PerBaseEntity) == 0){
                        /* Disable Base */
                        CLKPWR_EnableEntity((CLKPWR_ENTITY_T)CLKPWR_PERIPHERAL_Info[PPType].PerBaseEntity,0);
                }
        }else{
                /* enable */
                /* GetBase Status*/
                if((CLKPWR_PERIPHERAL_Info[PPType].RegBaseEntity!=CLKPWR_ENTITY_NONE) && CLKPWR_REG_BASE_CTRL(PPType) & 1){
                        /* Enable Base */
                        CLKPWR_EnableEntity((CLKPWR_ENTITY_T)CLKPWR_PERIPHERAL_Info[PPType].RegBaseEntity, 1);
                }
                /*Get Reg branch status */
                if((CLKPWR_PERIPHERAL_Info[PPType].RegBranchOffset!= 0) && !(CLKPWR_REG_BRANCH_STATUS(PPType) & 1)){
                        CLKPWR_REG_BRANCH_CTRL(PPType) |= 1; /* Enable branch clock */
                        while(!(CLKPWR_REG_BRANCH_STATUS(PPType) & 1));
                }

                /* Same for Peripheral */
                /* GetBase Status*/
                if((CLKPWR_PERIPHERAL_Info[PPType].PerBaseEntity != CLKPWR_ENTITY_NONE) &&
                                (CLKPWR_PER_BASE_CTRL(PPType) & 1)){
                        /* Enable Base */
                        CLKPWR_EnableEntity((CLKPWR_ENTITY_T)CLKPWR_PERIPHERAL_Info[PPType].PerBaseEntity, 1);
                }
                /*Get Reg branch status */
                if((CLKPWR_PERIPHERAL_Info[PPType].PerBranchOffset!= 0) && !(CLKPWR_PER_BRANCH_STATUS(PPType) & 1)){
                        CLKPWR_PER_BRANCH_CTRL(PPType) |= 1; /* Enable branch clock */
                        while(!(CLKPWR_PER_BRANCH_STATUS(PPType) & 1));
                }

