QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/source/platform/hal/nxp/mcu/LPC18xx/vendor/lpc18xx_clkpwr.c
        }

        if(CLKPWR_PERIPHERAL_Info[PPType].next){
                return CLKPWR_ConfigPWR((CLKPWR_PERIPHERAL_T)CLKPWR_PERIPHERAL_Info[PPType].next, en);
        }
        return CLKPWR_ERROR_SUCCESS;
}

uint32_t CLKPWR_GetPCLKFrequency (CLKPWR_PERIPHERAL_T Clock){
        uint32_t ClkSrc;
        if(Clock >= CLKPWR_PERIPHERAL_WWDT && Clock <= CLKPWR_PERIPHERAL_ADC0)
                return CLKPWR_ERROR_INVALID_PARAM;

        if(CLKPWR_PERIPHERAL_Info[Clock].PerBaseEntity != CLKPWR_ENTITY_NONE){
                /* Get Base Clock Source */
                ClkSrc = (CLKPWR_PER_BASE_CTRL(Clock) & CLKPWR_CTRL_SRC_MASK) >> 24;
                /* GetBase Status*/
                if(CLKPWR_PER_BASE_CTRL(Clock) & 1)
                        return 0;
                /* check Branch if it is enabled */
                if((CLKPWR_PERIPHERAL_Info[Clock].PerBranchOffset!= 0) && !(CLKPWR_PER_BRANCH_STATUS(Clock) & 1)) return 0;
        }else{
                if(CLKPWR_REG_BASE_CTRL(Clock) & 1)     return 0;
                ClkSrc = (CLKPWR_REG_BASE_CTRL(Clock) & CLKPWR_CTRL_SRC_MASK) >> 24;
                /* check Branch if it is enabled */
                if((CLKPWR_PERIPHERAL_Info[Clock].RegBranchOffset!= 0) && !(CLKPWR_REG_BRANCH_STATUS(Clock) & 1)) return 0;
        }
        return CLKPWR_ClockSourceFrequency[ClkSrc];
}

void CLKPWR_UpdateClock(void){
        uint32_t ClkSrc;
        uint32_t div;
        uint32_t divisor;
        int32_t RegOffset;
        /* 32OSC */
        if(ISBITSET(LPC_CREG->CREG0,1) && ISBITCLR(LPC_CREG->CREG0,3))
                CLKPWR_ClockSourceFrequency[CLKPWR_CLKSRC_32KHZ_OSC] = 32768;
        else
                CLKPWR_ClockSourceFrequency[CLKPWR_CLKSRC_32KHZ_OSC] = 0;
        /*PLL0*/
        /* PLL1 */
        if(ISBITCLR(LPC_CGU->PLL1_CTRL,1) /* Enabled */
                        && (LPC_CGU->PLL1_STAT&1)){ /* Locked? */
                ClkSrc = (LPC_CGU->PLL1_CTRL & CLKPWR_CTRL_SRC_MASK)>>24;
                CLKPWR_ClockSourceFrequency[CLKPWR_CLKSRC_PLL1] = CLKPWR_ClockSourceFrequency[ClkSrc] *
                                                                                                                        (((LPC_CGU->PLL1_CTRL>>16)&0xFF)+1);
        }else
                CLKPWR_ClockSourceFrequency[CLKPWR_CLKSRC_PLL1] = 0;

        /* DIV */
        for(div = CLKPWR_CLKSRC_IDIVA; div <= CLKPWR_CLKSRC_IDIVE; div++){
                RegOffset = CLKPWR_Entity_ControlReg_Offset[div];
                if(ISBITCLR(CLKPWR_ADDRESS32(LPC_CGU,RegOffset),1)){
                        ClkSrc = (CLKPWR_ADDRESS32(LPC_CGU,RegOffset) & CLKPWR_CTRL_SRC_MASK) >> 24;
                        divisor = (CLKPWR_ADDRESS32(LPC_CGU,RegOffset)>>2) & 0xFF;
                        divisor ++;
                        CLKPWR_ClockSourceFrequency[div] = CLKPWR_ClockSourceFrequency[ClkSrc] / divisor;
                }else
                        CLKPWR_ClockSourceFrequency[div] = 0;
        }
}

uint32_t        CLKPWR_SetXTALOSC(uint32_t ClockFrequency){
        if(ClockFrequency < 15000000){
                LPC_CGU->XTAL_OSC_CTRL &= ~(1<<2);
        }else if(ClockFrequency < 25000000){
                LPC_CGU->XTAL_OSC_CTRL |= (1<<2);
        }else
                return CLKPWR_ERROR_FREQ_OUTOF_RANGE;

        CLKPWR_ClockSourceFrequency[CLKPWR_CLKSRC_XTAL_OSC] = ClockFrequency;
        return CLKPWR_ERROR_SUCCESS;
}

/* divisor number must >=1*/
uint32_t        CLKPWR_SetDIV(CLKPWR_ENTITY_T SelectDivider, uint32_t divisor){
        int32_t RegOffset;
        uint32_t tempReg;
        if(SelectDivider>=CLKPWR_CLKSRC_IDIVA && SelectDivider<=CLKPWR_CLKSRC_IDIVE){
                RegOffset = CLKPWR_Entity_ControlReg_Offset[SelectDivider];
                if(RegOffset == -1) return CLKPWR_ERROR_INVALID_ENTITY;
                tempReg = CLKPWR_ADDRESS32(LPC_CGU,RegOffset);
                tempReg &= ~(0xFF<<2);
                tempReg |= ((divisor-1)&0xFF)<<2;
                CLKPWR_ADDRESS32(LPC_CGU,RegOffset) = tempReg;
                return CLKPWR_ERROR_SUCCESS;
        }
        return CLKPWR_ERROR_INVALID_ENTITY;
}

uint32_t CLKPWR_EnableEntity(CLKPWR_ENTITY_T ClockEntity, uint32_t en){
        int32_t RegOffset;
        int32_t i;
        if(ClockEntity == CLKPWR_CLKSRC_32KHZ_OSC){
                if(en){
                        LPC_CREG->CREG0 &= ~((1<<3)|(1<<2));
                        LPC_CREG->CREG0 |= (1<<1)|(1<<0);
                }else{
                        LPC_CREG->CREG0 &= ~((1<<1)|(1<<0));
                        LPC_CREG->CREG0 |= (1<<3);
                }
                for(i = 0;i<1000000;i++);

        }else if(ClockEntity == CLKPWR_CLKSRC_ENET_RX_CLK){
                scu_pinmux(0xC ,0 , MD_PLN, FUNC3);

        }else if(ClockEntity == CLKPWR_CLKSRC_ENET_TX_CLK){
                scu_pinmux(0x1 ,19 , MD_PLN, FUNC0);

        }else if(ClockEntity == CLKPWR_CLKSRC_GP_CLKIN){

        }else if(ClockEntity == CLKPWR_CLKSRC_TCK){

        }else if(ClockEntity == CLKPWR_CLKSRC_XTAL_OSC){
                if(!en)
                        LPC_CGU->XTAL_OSC_CTRL |= CLKPWR_CTRL_EN_MASK;
                else
                        LPC_CGU->XTAL_OSC_CTRL &= ~CLKPWR_CTRL_EN_MASK;
                /*Delay for stable clock*/
                for(i = 0;i<1000000;i++);

        }else{
                RegOffset = CLKPWR_Entity_ControlReg_Offset[ClockEntity];
                if(RegOffset == -1) return CLKPWR_ERROR_INVALID_ENTITY;
                if(!en){
                        CLKPWR_ADDRESS32(CLKPWR_CGU_ADDR,RegOffset) |= CLKPWR_CTRL_EN_MASK;
                }else{
                        CLKPWR_ADDRESS32(CLKPWR_CGU_ADDR,RegOffset) &= ~CLKPWR_CTRL_EN_MASK;
                        /*if PLL is selected check if it is locked */
                        if(ClockEntity == CLKPWR_CLKSRC_PLL0){
                                while((LPC_CGU->PLL0USB_STAT&1) == 0x0);
                        }
                        if(ClockEntity == CLKPWR_CLKSRC_PLL1){
                                while((LPC_CGU->PLL1_STAT&1) == 0x0);
                                /*post check lock status */
                                if(!(LPC_CGU->PLL1_STAT&1))
                                        while(1);
                        }
                }
        }
        return CLKPWR_ERROR_SUCCESS;
}

uint32_t CLKPWR_EntityConnect(CLKPWR_ENTITY_T ClockSource, CLKPWR_ENTITY_T ClockEntity){
        int32_t RegOffset;
        uint32_t tempReg;

        if(ClockSource > CLKPWR_CLKSRC_IDIVE)
                return CLKPWR_ERROR_INVALID_CLOCK_SOURCE;

