QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/source/platform/hal/nxp/mcu/LPC18xx/vendor/lpc18xx_clkpwr.c
        if(ClockEntity >= CLKPWR_CLKSRC_PLL0 && ClockEntity <= CLKPWR_BASE_CLKOUT){
                if(CLKPWR_ConnectAlloc_Tbl[ClockSource][ClockEntity]){
                        RegOffset = CLKPWR_Entity_ControlReg_Offset[ClockSource];
                        if(RegOffset != -1){
                                if(ClockEntity<=CLKPWR_CLKSRC_IDIVE &&
                                        ClockEntity>=CLKPWR_CLKSRC_PLL0)
                                {
                                        //RegOffset = (CLKPWR_ADDRESS32(LPC_CGU,RegOffset)>>24)&0xF;
                                        if((CLKPWR_ADDRESS32(LPC_CGU,RegOffset)>>24)&0xF == ClockEntity)
                                                return CLKPWR_ERROR_CONNECT_TOGETHER;
                                }
                        }
                        RegOffset = CLKPWR_Entity_ControlReg_Offset[ClockEntity];
                        if(RegOffset == -1) return CLKPWR_ERROR_INVALID_ENTITY;
                        tempReg = CLKPWR_ADDRESS32(LPC_CGU,RegOffset);
                        tempReg &= ~CLKPWR_CTRL_SRC_MASK;
                        tempReg |= ClockSource<<24 | CLKPWR_CTRL_AUTOBLOCK_MASK;
                        CLKPWR_ADDRESS32(LPC_CGU,RegOffset) = tempReg;
                        return CLKPWR_ERROR_SUCCESS;
                }else
                        return CLKPWR_ERROR_INVALID_CLOCK_SOURCE;
        }else
                return CLKPWR_ERROR_INVALID_ENTITY;
}

/* Currently USB PLL Get Clock from XTAL */
uint32_t CLKPWR_SetPLL0(void){
        // Setup PLL550 to generate 480MHz from 12 MHz crystal
        //LPC_CGU->PL550M_0_C |= PD_ENABLE;     // Power down PLL
                                                //      P                       N
        LPC_CGU->PLL0USB_NP_DIV = (98<<0) | (514<<12);
                                                //      SELP    SELI    SELR    MDEC
        LPC_CGU->PLL0USB_MDIV = (0xB<<17)|(0x10<<22)|(0<<28)|(0x7FFA<<0);
        LPC_CGU->PLL0USB_CTRL =(CLKPWR_CLKSRC_XTAL_OSC<<24) | (0x3<<2) | (1<<4);
        return CLKPWR_ERROR_SUCCESS;
}

/*To set PLL first disable it
 * connect it to source clock
 * set PLL mult
 * enable it */
uint32_t        CLKPWR_SetPLL1(uint32_t mult){
        uint32_t msel=0, nsel=0, psel=0, pval=1;
        uint32_t freq;
        uint32_t ClkSrc = (LPC_CGU->PLL1_CTRL & CLKPWR_CTRL_SRC_MASK)>>24;
        freq = CLKPWR_ClockSourceFrequency[ClkSrc];
        freq *= mult;
        msel = mult-1;

        LPC_CGU->PLL1_CTRL &= ~(CLKPWR_PLL1_FBSEL_MASK |
                                                                        CLKPWR_PLL1_BYPASS_MASK |
                                                                        CLKPWR_PLL1_DIRECT_MASK |
                                                                        (0x03<<8) | (0xFF<<16) | (0x03<<12));

        if(freq<156000000){
                //psel is encoded such that 0=1, 1=2, 2=4, 3=8
                while(2*(pval)*freq < 156000000) {
                        psel++;
                        pval*=2;
                }
//              if(2*(pval)*freq > 320000000) {
//                      //THIS IS OUT OF RANGE!!!
//                      //HOW DO WE ASSERT IN SAMPLE CODE?
//                      //__breakpoint(0);
//                      return CLKPWR_ERROR_INVALID_PARAM;
//              }
                LPC_CGU->PLL1_CTRL |= (msel<<16) | (nsel<<12) | (psel<<8) | CLKPWR_PLL1_FBSEL_MASK;
        }else if(freq<320000000){
                LPC_CGU->PLL1_CTRL |= (msel<<16) | (nsel<<12) | (psel<<8) |CLKPWR_PLL1_DIRECT_MASK | CLKPWR_PLL1_FBSEL_MASK;
        }else
                return CLKPWR_ERROR_INVALID_PARAM;

        return CLKPWR_ERROR_SUCCESS;
}

uint32_t        CLKPWR_GetBaseStatus(CLKPWR_ENTITY_T Base){
        switch(Base){
        /*CCU1*/
        case CLKPWR_BASE_APB3:
                return LPC_CCU1->BASE_STAT & 1;

        case CLKPWR_BASE_APB1:
                return (LPC_CCU1->BASE_STAT>>1) & 1;

        case CLKPWR_BASE_SPIFI:
                return (LPC_CCU1->BASE_STAT>>2) & 1;

        case CLKPWR_BASE_M3:
                return (LPC_CCU1->BASE_STAT>>3) & 1;

        case CLKPWR_BASE_USB0:
                return (LPC_CCU1->BASE_STAT>>7) & 1;

        case CLKPWR_BASE_USB1:
                return (LPC_CCU1->BASE_STAT>>8) & 1;

        /*CCU2*/
        case CLKPWR_BASE_UART3:
                return (LPC_CCU2->BASE_STAT>>1) & 1;

        case CLKPWR_BASE_UART2:
                return (LPC_CCU2->BASE_STAT>>2) & 1;

        case CLKPWR_BASE_UART1:
                return (LPC_CCU2->BASE_STAT>>3) & 1;

        case CLKPWR_BASE_UART0:
                return (LPC_CCU2->BASE_STAT>>4) & 1;

        case CLKPWR_BASE_SSP1:
                return (LPC_CCU2->BASE_STAT>>5) & 1;

        case CLKPWR_BASE_SSP0:
                return (LPC_CCU2->BASE_STAT>>6) & 1;

        case CLKPWR_BASE_SDIO:
                return (LPC_CCU2->BASE_STAT>>7) & 1;

        /*BASE SAFE is used by WWDT and RGU*/
        case CLKPWR_BASE_SAFE:
                break;
        }
        return 0;
}

/*
 * Compare to IRC clock
 * FClock = F_IRC* m / d
 * */
int CLKPWR_FrequencyMonitor(CLKPWR_ENTITY_T Clock, uint32_t *m, uint32_t *d){
        uint32_t n,c,temp;
        int i;

        /* Maximum allow RCOUNT number */
        c= 511;
        /* Check Source Clock Freq is larger or smaller */
        LPC_CGU->FREQ_MON = (Clock<<24) | 1<<23 | c;
        while(LPC_CGU->FREQ_MON & (1 <<23));
        for(i=0;i<10000;i++);
        temp = (LPC_CGU->FREQ_MON >>9) & 0x3FFF;

        if(temp == 0) /* too low F < 12000000/511*/
                return -1;
        if(temp > 511){ /* larger */

                c = 511 - (LPC_CGU->FREQ_MON&0x1FF);
        }else{
                do{
                        c--;
                        LPC_CGU->FREQ_MON = (Clock<<24) | 1<<23 | c;
                        while(LPC_CGU->FREQ_MON & (1 <<23));
                        for(i=0;i<10000;i++);
                        n = (LPC_CGU->FREQ_MON >>9) & 0x3FFF;
                }while(n==temp);
                c++;
        }
        *m = temp;
        *d = c;
        return 0;
}

