QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/source/platform/hal/nxp/mcu/LPC18xx/vendor/lpc18xx_clkpwr.c
/*
        Compare Clock to CompareToClock
        FClock = m*FCompareToClock/d
*/
uint32_t CLKPWR_RealFrequencyCompare(CLKPWR_ENTITY_T Clock, CLKPWR_ENTITY_T CompareToClock, uint32_t *m, uint32_t *d){
        uint32_t m1,m2,d1,d2;
        /* Check Parameter */
        if((Clock>CLKPWR_CLKSRC_IDIVE) || (CompareToClock>CLKPWR_CLKSRC_IDIVE))
                return CLKPWR_ERROR_INVALID_PARAM;
        /* Check for Clock Enable - Not yet implement
         * The Comparator will hang if Clock has not been set*/
        CLKPWR_FrequencyMonitor(Clock, &m1, &d1);
        CLKPWR_FrequencyMonitor(CompareToClock, &m2, &d2);
        *m= m1*d2;
        *d= d1*m2;
        return 0;

}
/*********************************************************************//**
 * @brief               Enter Sleep mode with co-operated instruction by the Cortex-M3.
 * @param[in]   None
 * @return              None
 **********************************************************************/
void CLKPWR_Sleep(void)
{
        //LPC_PMC->SLEEP0_MODE = 0x00;
        /* Sleep Mode*/
        __WFI();
}


/*********************************************************************//**
 * @brief               Enter Deep Sleep mode with co-operated instruction by the Cortex-M3.
 * @param[in]   None
 * @return              None
 **********************************************************************/
void CLKPWR_DeepSleep(void)
{
    /* Deep-Sleep Mode, set SLEEPDEEP bit */
        SCB->SCR = 0x4;
        LPC_PMC->PD0_SLEEP0_MODE = CLKPWR_SLEEP_MODE_DEEP_SLEEP;
        /* Deep Sleep Mode*/
        __WFI();
}


/*********************************************************************//**
 * @brief               Enter Power Down mode with co-operated instruction by the Cortex-M3.
 * @param[in]   None
 * @return              None
 **********************************************************************/
void CLKPWR_PowerDown(void)
{
    /* Deep-Sleep Mode, set SLEEPDEEP bit */
        SCB->SCR = 0x4;
        LPC_PMC->PD0_SLEEP0_MODE = CLKPWR_SLEEP_MODE_POWER_DOWN;
        /* Power Down Mode*/
        __WFI();
}


/*********************************************************************//**
 * @brief               Enter Deep Power Down mode with co-operated instruction by the Cortex-M3.
 * @param[in]   None
 * @return              None
 **********************************************************************/
void CLKPWR_DeepPowerDown(void)
{
    /* Deep-Sleep Mode, set SLEEPDEEP bit */
        SCB->SCR = 0x4;
        LPC_PMC->PD0_SLEEP0_MODE = CLKPWR_SLEEP_MODE_DEEP_POWER_DOWN;
        /* Deep Power Down Mode*/
        __WFI();
}

/**
 * @}
 */

/**
 * @}
 */

/* --------------------------------- End Of File ------------------------------ */
